Microchip-MPLAB-Harmony/usb_apps_device/apps/vendor/firmware/src/packs/ATSAMA5D27CLD2G_DFP/component/uart.h
/* -------- UART_IMR : (UART Offset: 0x10) ( R/ 32) Interrupt Mask Register -------- */
#define UART_IMR_RXRDY_Pos                    _UINT32_(0)                                          /* (UART_IMR) Mask RXRDY Interrupt Position */
#define UART_IMR_RXRDY_Msk                    (_UINT32_(0x1) << UART_IMR_RXRDY_Pos)                /* (UART_IMR) Mask RXRDY Interrupt Mask */
#define UART_IMR_RXRDY(value)                 (UART_IMR_RXRDY_Msk & (_UINT32_(value) << UART_IMR_RXRDY_Pos)) /* Assigment of value for RXRDY in the UART_IMR register */
#define UART_IMR_TXRDY_Pos                    _UINT32_(1)                                          /* (UART_IMR) Disable TXRDY Interrupt Position */
#define UART_IMR_TXRDY_Msk                    (_UINT32_(0x1) << UART_IMR_TXRDY_Pos)                /* (UART_IMR) Disable TXRDY Interrupt Mask */
#define UART_IMR_TXRDY(value)                 (UART_IMR_TXRDY_Msk & (_UINT32_(value) << UART_IMR_TXRDY_Pos)) /* Assigment of value for TXRDY in the UART_IMR register */
#define UART_IMR_OVRE_Pos                     _UINT32_(5)                                          /* (UART_IMR) Mask Overrun Error Interrupt Position */
#define UART_IMR_OVRE_Msk                     (_UINT32_(0x1) << UART_IMR_OVRE_Pos)                 /* (UART_IMR) Mask Overrun Error Interrupt Mask */
#define UART_IMR_OVRE(value)                  (UART_IMR_OVRE_Msk & (_UINT32_(value) << UART_IMR_OVRE_Pos)) /* Assigment of value for OVRE in the UART_IMR register */
#define UART_IMR_FRAME_Pos                    _UINT32_(6)                                          /* (UART_IMR) Mask Framing Error Interrupt Position */
#define UART_IMR_FRAME_Msk                    (_UINT32_(0x1) << UART_IMR_FRAME_Pos)                /* (UART_IMR) Mask Framing Error Interrupt Mask */
#define UART_IMR_FRAME(value)                 (UART_IMR_FRAME_Msk & (_UINT32_(value) << UART_IMR_FRAME_Pos)) /* Assigment of value for FRAME in the UART_IMR register */
#define UART_IMR_PARE_Pos                     _UINT32_(7)                                          /* (UART_IMR) Mask Parity Error Interrupt Position */
#define UART_IMR_PARE_Msk                     (_UINT32_(0x1) << UART_IMR_PARE_Pos)                 /* (UART_IMR) Mask Parity Error Interrupt Mask */
#define UART_IMR_PARE(value)                  (UART_IMR_PARE_Msk & (_UINT32_(value) << UART_IMR_PARE_Pos)) /* Assigment of value for PARE in the UART_IMR register */
#define UART_IMR_TIMEOUT_Pos                  _UINT32_(8)                                          /* (UART_IMR) Mask Time-out Interrupt Position */
#define UART_IMR_TIMEOUT_Msk                  (_UINT32_(0x1) << UART_IMR_TIMEOUT_Pos)              /* (UART_IMR) Mask Time-out Interrupt Mask */
#define UART_IMR_TIMEOUT(value)               (UART_IMR_TIMEOUT_Msk & (_UINT32_(value) << UART_IMR_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the UART_IMR register */
#define UART_IMR_TXEMPTY_Pos                  _UINT32_(9)                                          /* (UART_IMR) Mask TXEMPTY Interrupt Position */
#define UART_IMR_TXEMPTY_Msk                  (_UINT32_(0x1) << UART_IMR_TXEMPTY_Pos)              /* (UART_IMR) Mask TXEMPTY Interrupt Mask */
#define UART_IMR_TXEMPTY(value)               (UART_IMR_TXEMPTY_Msk & (_UINT32_(value) << UART_IMR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the UART_IMR register */
#define UART_IMR_CMP_Pos                      _UINT32_(15)                                         /* (UART_IMR) Mask Comparison Interrupt Position */
#define UART_IMR_CMP_Msk                      (_UINT32_(0x1) << UART_IMR_CMP_Pos)                  /* (UART_IMR) Mask Comparison Interrupt Mask */
#define UART_IMR_CMP(value)                   (UART_IMR_CMP_Msk & (_UINT32_(value) << UART_IMR_CMP_Pos)) /* Assigment of value for CMP in the UART_IMR register */
#define UART_IMR_Msk                          _UINT32_(0x000083E3)                                 /* (UART_IMR) Register Mask  */


/* -------- UART_SR : (UART Offset: 0x14) ( R/ 32) Status Register -------- */
#define UART_SR_RXRDY_Pos                     _UINT32_(0)                                          /* (UART_SR) Receiver Ready Position */
#define UART_SR_RXRDY_Msk                     (_UINT32_(0x1) << UART_SR_RXRDY_Pos)                 /* (UART_SR) Receiver Ready Mask */
#define UART_SR_RXRDY(value)                  (UART_SR_RXRDY_Msk & (_UINT32_(value) << UART_SR_RXRDY_Pos)) /* Assigment of value for RXRDY in the UART_SR register */
#define UART_SR_TXRDY_Pos                     _UINT32_(1)                                          /* (UART_SR) Transmitter Ready Position */
#define UART_SR_TXRDY_Msk                     (_UINT32_(0x1) << UART_SR_TXRDY_Pos)                 /* (UART_SR) Transmitter Ready Mask */
#define UART_SR_TXRDY(value)                  (UART_SR_TXRDY_Msk & (_UINT32_(value) << UART_SR_TXRDY_Pos)) /* Assigment of value for TXRDY in the UART_SR register */
#define UART_SR_OVRE_Pos                      _UINT32_(5)                                          /* (UART_SR) Overrun Error Position */
#define UART_SR_OVRE_Msk                      (_UINT32_(0x1) << UART_SR_OVRE_Pos)                  /* (UART_SR) Overrun Error Mask */
#define UART_SR_OVRE(value)                   (UART_SR_OVRE_Msk & (_UINT32_(value) << UART_SR_OVRE_Pos)) /* Assigment of value for OVRE in the UART_SR register */
#define UART_SR_FRAME_Pos                     _UINT32_(6)                                          /* (UART_SR) Framing Error Position */
#define UART_SR_FRAME_Msk                     (_UINT32_(0x1) << UART_SR_FRAME_Pos)                 /* (UART_SR) Framing Error Mask */
#define UART_SR_FRAME(value)                  (UART_SR_FRAME_Msk & (_UINT32_(value) << UART_SR_FRAME_Pos)) /* Assigment of value for FRAME in the UART_SR register */
#define UART_SR_PARE_Pos                      _UINT32_(7)                                          /* (UART_SR) Parity Error Position */
#define UART_SR_PARE_Msk                      (_UINT32_(0x1) << UART_SR_PARE_Pos)                  /* (UART_SR) Parity Error Mask */
#define UART_SR_PARE(value)                   (UART_SR_PARE_Msk & (_UINT32_(value) << UART_SR_PARE_Pos)) /* Assigment of value for PARE in the UART_SR register */
#define UART_SR_TIMEOUT_Pos                   _UINT32_(8)                                          /* (UART_SR) Receiver Time-out Position */
#define UART_SR_TIMEOUT_Msk                   (_UINT32_(0x1) << UART_SR_TIMEOUT_Pos)               /* (UART_SR) Receiver Time-out Mask */
#define UART_SR_TIMEOUT(value)                (UART_SR_TIMEOUT_Msk & (_UINT32_(value) << UART_SR_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the UART_SR register */
#define UART_SR_TXEMPTY_Pos                   _UINT32_(9)                                          /* (UART_SR) Transmitter Empty Position */
#define UART_SR_TXEMPTY_Msk                   (_UINT32_(0x1) << UART_SR_TXEMPTY_Pos)               /* (UART_SR) Transmitter Empty Mask */
#define UART_SR_TXEMPTY(value)                (UART_SR_TXEMPTY_Msk & (_UINT32_(value) << UART_SR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the UART_SR register */
#define UART_SR_CMP_Pos                       _UINT32_(15)                                         /* (UART_SR) Comparison Match Position */
#define UART_SR_CMP_Msk                       (_UINT32_(0x1) << UART_SR_CMP_Pos)                   /* (UART_SR) Comparison Match Mask */
#define UART_SR_CMP(value)                    (UART_SR_CMP_Msk & (_UINT32_(value) << UART_SR_CMP_Pos)) /* Assigment of value for CMP in the UART_SR register */
#define UART_SR_SWES_Pos                      _UINT32_(21)                                         /* (UART_SR) SleepWalking Enable Status Position */
#define UART_SR_SWES_Msk                      (_UINT32_(0x1) << UART_SR_SWES_Pos)                  /* (UART_SR) SleepWalking Enable Status Mask */
#define UART_SR_SWES(value)                   (UART_SR_SWES_Msk & (_UINT32_(value) << UART_SR_SWES_Pos)) /* Assigment of value for SWES in the UART_SR register */
#define UART_SR_CLKREQ_Pos                    _UINT32_(22)                                         /* (UART_SR) Clock Request Position */
#define UART_SR_CLKREQ_Msk                    (_UINT32_(0x1) << UART_SR_CLKREQ_Pos)                /* (UART_SR) Clock Request Mask */
#define UART_SR_CLKREQ(value)                 (UART_SR_CLKREQ_Msk & (_UINT32_(value) << UART_SR_CLKREQ_Pos)) /* Assigment of value for CLKREQ in the UART_SR register */
#define UART_SR_WKUPREQ_Pos                   _UINT32_(23)                                         /* (UART_SR) Wake-Up Request Position */
#define UART_SR_WKUPREQ_Msk                   (_UINT32_(0x1) << UART_SR_WKUPREQ_Pos)               /* (UART_SR) Wake-Up Request Mask */
#define UART_SR_WKUPREQ(value)                (UART_SR_WKUPREQ_Msk & (_UINT32_(value) << UART_SR_WKUPREQ_Pos)) /* Assigment of value for WKUPREQ in the UART_SR register */
#define UART_SR_Msk                           _UINT32_(0x00E083E3)                                 /* (UART_SR) Register Mask  */


